Revit 2027 API
Subelement.TypeId Property
 The identifier of this subelement's type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TypeId { get; }
Public ReadOnly Property TypeId As ElementId
	Get
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
member TypeId : ElementId with get
Property Value
ElementId
Remarks
 Some subelements cannot have type assigned, in which case this method returns invalid element id.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace